Repository: cloudnepal/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru, sv

source: Account overview
ru: Обзор учетной записи
sv: Kontoöversikt

# accounts_intro
source: On this page you can create accounts for multiple students at once. These are automatically added to the current class, so make sure the class shown above is the right one! Every username needs to be unique in the entire Hedy system. You can use 'Postfix classname' to add your class name to all accounts. If you manually enter passwords, these need to be <b>at least</b> 6 characters.
ru: На этой странице вы можете создать учетные записи сразу для нескольких учеников. Они автоматически добавляются к текущему классу, поэтому убедитесь, что показанный выше класс - правильный! Каждое имя пользователя должно быть уникальным во всей системе Hedy. Вы можете использовать 'Постфикс имени класса', чтобы добавить имя вашего класса ко всем учетным записям. Если вы вводите пароли вручную, они должны быть <b>не менее</b> 6 символов.
sv: På den här sidan kan du skapa konton för flera elever samtidigt. Deläggs automatiskt till i den aktuella klassen, så se till att klassen som visas ovan är rätt klass! Varje användarnamn måste vara unikt i hela Hedy-systemet. Du kan använda "Postfix classname" för att lägga till ditt klassnamn till alla konton. Om du anger lösenord manuellt måste de ha <b>minst</b> sex tecken.

source: Add students
ru: Добавить студентов
sv: Lägg till elever

source: Admin
ru: Администратор
sv: Administration

# advance_button
source: Go to level {level}
ru: На уровень {level}
sv: Gå till nivå {level}

source: Adventure
ru: Приключения
sv: Äventyr

# adventure_duplicate
source: You already have an adventure with this name.
ru: У вас уже есть приключение с этим названием.
sv: Du har redan ett äventyr med det här namnet.

# adventure_empty
source: You didn't enter an adventure name!
ru: Вы не ввели название приключения!
sv: Du har inte angett ett äventyrsnamn!

# adventure_exp_3
source: Make sure you always surround keywords with { }, then they are recognized correctly. You can use the "preview" button to view a styled version of your adventure. To view the adventure on a dedicated page, select "view" from the teachers page.
ru: Убедитесь, что вы всегда окружаете ключевые слова символом { }, тогда они будут распознаны правильно. Вы можете использовать кнопку "предварительный просмотр" для просмотра стилизованной версии вашего приключения. Чтобы просмотреть приключение на специальной странице, выберите "просмотр" на странице учителя.

# adventure_id_invalid
source: This adventure id is invalid.
ru: Неверный идентификатор приключения.
sv: Äventyrs-id är ogiltigt.

# adventure_length
source: Your adventure has to be at least 20 characters.
ru: Название приключения должно состоять из минимум 20 символов.
sv: Ditt äventyr måste ha minst 20 tecken.

# adventure_name_invalid
source: This adventure name is invalid.
ru: Название приключения неверно.
sv: Äventyrsnamnet är ogiltigt.

# adventure_prompt
source: Please enter the name of the adventure
ru: Пожалуйста введите название приключения
sv: Mata in äventyrets namn

# adventure_terms
source: I agree that my adventure might be made publicly available on Hedy.
ru: Я соглашаюсь с тем, что моё приключение будет доступно всем на сайте Хеди.
sv: Jag samtycker till att mitt äventyr kan göras tillgängligt för allmänheten på Hedy.

# adventure_updated
source: The adventure has been updated!
ru: Приключение было обновлено!
sv: Äventyret har uppdaterats!

# ago
source: {timestamp} ago
ru: {timestamp} назад
sv: för {timestamp} sen

# agree_invalid
source: You have to agree with the privacy terms.
ru: Я соглашаюсь с условиями конфиденциальности.
sv: Du måste godkänna sekretessvillkoren.

# agree_with
source: I agree to the
ru: Я соглашаюсь с
sv: Jag godkänner

# ajax_error
source: There was an error, please try again.
ru: Произошла ошибка, пожалуйста, попробуйте еще раз.
sv: Det uppstod ett fel, försök igen.

source: All
ru: Все
sv: Allt

# all_class_highscores
source: All students visible in class highscores
ru: Все учащиеся видны в рейтингах класса
sv: Alla elever syns i klassens toppresultat

# already_account
source: Already have an account?
ru: У вас уже есть учётная запись?
sv: Har du redan ett konto?

# already_program_running
source: There is already a program running, finish that one first.
ru: Какая-то программа уже исполняется, подождите когда она закончит выполнение.
sv: Det finns redan ett pågående program, avsluta det först.

# already_teacher
source: You already have a teacher account.
ru: У вас уже есть преподавательская учётная запись.
sv: Du har redan ett lärarkonto.

# already_teacher_request
source: You already have a pending teacher request.
ru: Вы уже запросили преподавательскую учётную запись.
sv: Du har redan en väntande lärarförfrågan.

# are_you_sure
source: Are you sure? You cannot revert this action.
ru: Вы уверены? Это действие невозможно будет отменить или откатить.
sv: Är du säker? Du kan inte ångra den här åtgärden.

# ask_needs_var
source: Starting in level 2, `{ask}` needs to be used with a variable. Example: name {is} {ask} What are you called?
ru: Начиная со второго уровня, `{ask}` нужно использовать с переменной. Пример: имя `{is}` `{ask}` Как тебя зовут?
sv: Från och med nivå 2 måste `{ask}` användas med en variabel. Exempel: namn `{is}` `{ask}` Vad heter du?

source: Become a sponsor
ru: Станьте спонсором
sv: Bli sponsor

source: Birth year
ru: Год рождения
sv: Födelseår

source: by
ru: от
sv: av

source: Cancel
ru: Отменить
sv: Avbryt

# certificate
source: Certificate of Completion
ru: Сертификат о прохождении
sv: Diplom för genomförd utbildning

source: Certified teacher
ru: Сертифицированный преподаватель
sv: Certifierad lärare

source: Change password
ru: Изменить пароль
sv: Ändra lösenord

# cheatsheet_title
source: Cheatsheet
ru: Шпаргалка
sv: Lathund

# class_already_joined
source: You are already a student of class
ru: Вы уже являетесь учеником класса
sv: Du är redan elev i klassen

# class_customize_success
source: Class successfully customized.
ru: Класс успешно настроен.
sv: Klassen har anpassats.

# class_name_duplicate
source: You already have a class with this name.
ru: У вас уже есть класс с таким именем.
sv: Du har redan en klass med det namnet.

# class_name_empty
source: You didn't enter a class name!
ru: Вы не ввели название класса!
sv: Du har inte matat in något klassnamn!

# class_name_invalid
source: This class name is invalid.
ru: Имя этого класса недействительно.
sv: Klassnamnet är ogiltigt.

# class_name_prompt
source: Please enter the name of the new class
ru: Пожалуйста, введите название нового класса
sv: Ange namnet på den nya klassen

# comma
source: a comma
ru: запятая
sv: ett kommatecken

source: Commands
ru: Команды
sv: Kommandon

# congrats_message
source: Congratulations, {username}, you have reached the following results with Hedy!
ru: Поздравляем, {username}, вы завершили Hedy!
sv: Grattis, {username}, du har nått följande resultat med Hedy!

# content_invalid
source: This adventure is invalid.
ru: Это приключение недействительно.
sv: Äventyret är ogiltigt.

source: Contributor
ru: Вкладчик
sv: Bidragsgivare

# copy_clipboard
source: Successfully copied to clipboard
ru: Успешно скопировано в буфер обмена
sv: Kopierades till Urklipp

source: Copy join link
ru: Скопировать пригласительную ссылку
sv: Kopiera anslutningslänken

# copy_link_success
source: Join link successfully copied to clipboard
ru: Ссылка вступления успешно скопирована в буфер обмена
sv: Anslutningslänken har kopierats till Urklipp

source: Copy link to share
ru: Скопируйте ссылку, чтобы поделиться
sv: Kopiera länken för att dela den

# copy_mail_link
source: Please copy and paste this link into a new tab:
ru: Пожалуйста, скопируйте и вставьте эту ссылку в новую вкладку:
sv: Kopiera och klistra in den här länken i en ny flik:

# correct_answer
source: The correct answer is
ru: Правильный ответ
sv: Rätt svar är

source: Country
ru: Страна
sv: Land

# country_invalid
source: Please select a valid country.
ru: Пожалуйста, выберите действительную страну.
sv: Vänligen välj ett giltigt land.

source: Create account
ru: Создать аккаунт
sv: Skapa ett konto

source: Create accounts
ru: Создание аккаунтов
sv: Skapa konton

# create_accounts_prompt
source: Are you sure you want to create these accounts?
ru: Вы уверены, что хотите создать эти учетные записи?
sv: Är du säker på att du vill skapa kontona?

source: Create adventure
ru: Создать приключение
sv: Skapa ett äventyr

# create_class
source: Create a new class
ru: Создать новый класс
sv: Skapa en ny klass

source: Create multiple accounts
ru: Создание нескольких учетных записей
sv: Skapa flera konton

# create_question
source: Do you want to create one?
ru: Хотите ли вы его создать?
sv: Vill du skapa en?

# create_student_account
source: Create an account
ru: Создать аккаунт
sv: Skapa ett konto

# create_student_account_explanation
source: You can save your own programs with an account.
ru: Вы можете сохранять собственные программы, имея учетную запись.
sv: Du kan spara dina egna program med ett konto.

# create_teacher_account
source: Create a teacher account
ru: Создайте учетную запись учителя
sv: Skapa ett lärarkonto

# create_teacher_account_explanation
source: With a teacher account, you can save your programs and see the results of your students.
ru: Имея учетную запись учителя, вы можете сохранять свои программы и видеть результаты своих учеников.
sv: Med ett lärarkonto kan du spara dina program och se dina elevers resultat.

source: Creator
ru: Создатель
sv: Skapare

source: Current password
ru: Текущий пароль
sv: Aktuellt lösenord

# customization_deleted
source: Customizations successfully deleted.
ru: Настройки успешно удалены.
sv: Anpassningarna har tagits bort.

source: Customize adventure
ru: Настроить приключение
sv: Anpassa äventyret

source: Customize class
ru: Настроить класс
sv: Anpassa lektionen

# dash
source: a dash
ru: тире
sv: ett tankstreck

# default_404
source: We could not find that page...
ru: Мы не смогли найти эту страницу...
sv: Vi kunde inte hitta den sidan ...

# default_500
source: Something went wrong...
ru: Что-то пошло не так...
sv: Något gick fel ...

source: Delete
ru: Удалить
sv: Radera

# delete_adventure_prompt
source: Are you sure you want to remove this adventure?
ru: Вы уверены, что хотите удалить это приключение?
sv: Är du säker på att du vill ta bort äventyret?

# delete_class_prompt
source: Are you sure you want to delete the class?
ru: Вы уверены, что хотите удалить класс?
sv: Är du säker på att du vill ta bort lektionen?

# delete_confirm
source: Are you sure you want to delete the program?
ru: Вы уверены, что хотите удалить программу?
sv: Är du säker på att du vill ta bort programmet?

# delete_invite
source: Delete invitation
ru: Удалить приглашение
sv: Ta bort inbjudan

# delete_invite_prompt
source: Are you sure you want to remove this class invitation?
ru: Вы уверены, что хотите удалить это приглашение в класс?
sv: Är du säker på att du vill ta bort den här lektionsinbjudan?

# delete_public
source: Delete public profile
ru: Удалить публичный профиль
sv: Ta bort offentlig profil

# delete_success
source: Program deleted successfully.
ru: Программа успешно удалена.
sv: Programmet har raderats.

# destroy_profile
source: Delete profile
ru: Удалить профиль
sv: Ta bort profil

# developers_mode
source: Programmer's mode
ru: Режим программиста
sv: Programmerarläge

# directly_available
source: Directly open
ru: Прямое открытие
sv: Öppna direkt

# disabled_button_quiz
source: Your quiz score is below the threshold, try again!
ru: Ваша оценка за тест ниже порогового значения, попробуйте еще раз!
sv: Ditt resultat är under gränsen; försök igen!

source: Discord server
ru: Сервер Discord

source: Distinguished user
ru: Выдающийся пользователь
sv: Framstående användare

source: double quotes
ru: двойные кавычки
sv: dubbla citattecken

source: Download
ru: Скачать
sv: Ladda ner

# download_login_credentials
source: Do you want to download the login credentials after the accounts creation?
ru: Хотите ли вы загрузить учетные данные для входа в систему после создания учетных записей?
sv: Vill du ladda ner inloggningsuppgifterna när kontona har skapats?

source: Duplicate
ru: Дубликат
sv: Duplicera

# echo_out
source: Starting in level 2 `{echo}` is no longer needed. You can repeat an answer with `{ask}` and `{print}` now. Example: name is {ask} What are you called? {print} hello name
ru: Начиная со второго уровня `{echo}` больше не нужен. Теперь вы можете повторить ответ с помощью `{ask}` и `{print}`. Пример: имя `{ask}` Как тебя зовут? `{print}` привет имя
sv: Från och med nivå 2 behövs inte längre `{echo}`. Du kan nu istället upprepa ett svar med `{ask}` och `{print}`. Exempel: namnet är `{ask}` Vad heter du? `{print}` Hej namn

# edit_code_button
source: Edit code
ru: Изменить код
sv: Redigera kod

source: Email
ru: Электронная почта
sv: Mejl

# email_invalid
source: Please enter a valid email.
ru: Пожалуйста, введите действительный адрес электронной почты.
sv: Ange en giltig mejladress.

# end_quiz
source: Quiz end
ru: Окончание викторины
sv: Slut på quizet

source: English
ru: Английский
sv: engelska

source: Enter
ru: Войти
sv: Mata in

# enter_password
source: Enter a new password for
ru: Введите новый пароль для
sv: Ange ett nytt lösenord för

# enter_text
source: Enter your answer here...
ru: Введите свой ответ здесь...
sv: Skriv in ditt svar här ...

# error_logo_alt
source: Error logo
ru: Логотип ошибки
sv: Fel-logga

# exclamation mark
source: an exclamation mark
ru: восклицательный знак
sv: ett utropstecken

source: Exercise
ru: Упражнение
sv: Övning

# exercise_doesnt_exist
source: This exercise doesn't exist
ru: Этого упражнения не существует
sv: Övningen saknas

# exists_email
source: That email is already in use.
ru: Этот адрес электронной почты уже используется.
sv: Mejladressen används redan.

# exists_username
source: That username is already in use.
ru: Это имя пользователя уже используется.
sv: Användarnamnet är taget.

# experience_invalid
source: Please select a valid experience, choose (Yes, No).
ru: Пожалуйста, выберите действующий опыт, выберите (Да, Нет).
sv: Välj en giltig erfarenhet, alltså (Ja, Nej).

source: Expiration date
ru: Срок действия
sv: Förfallodatum

source: Explore programs
ru: Изучить программы
sv: Utforska program

# explore_programs_logo_alt
source: Explore programs icon
ru: Значок "Обзор программ"
sv: Utforska program-ikonen

# favourite_confirm
source: Are you sure you want to set this program as your favourite?
ru: Вы уверены, что хотите установить эту программу в качестве любимой?
sv: Är du säker på att du vill favoritmarkera det här programmet?

source: Favourite program
ru: Любимая программа
sv: Favoritprogram

# favourite_program_invalid
source: Your chosen favourite program is invalid.
ru: Выбранная любимая программа неверна.
sv: Ditt valda favoritprogram är ogiltigt.

# favourite_success
source: Your program is set as favourite.
ru: Ваша программа установлена как избранная.
sv: Ditt program är favoritmarkerat.

source: Female
ru: Женский
sv: Tjej

# float
source: a number
ru: число
sv: ett tal/antal

source: For teachers
ru: Для учителей
sv: För lärare

# forgot_password
source: Forgot your password?
ru: Забыли пароль?
sv: Har du glömt lösenordet?

source: From another teacher
ru: От другого учителя
sv: Från en annan lärare

# from_magazine_website
source: From a magazine or website
ru: Из журнала или веб-сайта
sv: Från en tidskrift eller webbplats

# from_video
source: From a video
ru: Из видео
sv: Från en video

# fun_statistics_msg
source: Here are some fun statistics!
ru: Вот несколько интересных статистических данных!
sv: Här är lite rolig statistik!

source: Gender
ru: Пол
sv: Kön

# gender_invalid
source: Please select a valid gender, choose (Female, Male, Other).
ru: Пожалуйста, выберите правильный пол, выберите (Женский, Мужской, Другой).
sv: Välj ett giltigt kön, välj (Tjej, Kille, Annat).

source: General settings
ru: Общие настройки
sv: Allmänna inställningar

source: Generate passwords
ru: Генерировать пароли
sv: Generera lösenord

# get_certificate
source: Get your certificate!
ru: Получите свой сертификат!
sv: Få ditt diplom!

# go_back_to_main
source: Go back to main page
ru: Вернуться на главную страницу
sv: Tillbaka till huvudsidan

source: Go to question
ru: Перейти к вопросу
sv: Gå till fråga

source: Go to quiz result
ru: Перейти к результату викторины
sv: Gå till quizresultat

# goto_profile
source: Go to my profile
ru: Перейти в мой профиль
sv: Gå till min profil

# heard_about_hedy
source: How have you heard about Hedy?
ru: Как вы узнали о Hedy?
sv: Hur har du hört talas om Hedy?

# heard_about_invalid
source: Please select a valid way you heard about us.
ru: Пожалуйста, выберите правильный способ, которым вы узнали о нас.
sv: Välj ett giltigt sätt hur du hörde talas om oss.

# hedy_choice_title
source: Hedy's Choice
ru: Выбор Хеди
sv: Hedys Val

# hedy_logo_alt
source: Hedy logo
ru: Логотип Хеди
sv: Hedy-logga

source: Hedy on Github
ru: Hedy на Github
sv: Hedy på Github

# hedy_tutorial_logo_alt
source: Hedy tutorial icon
ru: Иконка учебника Hedy
sv: Logga för Hedy-handledning

source: Hide cheatsheet
ru: Скрыть шпаргалку
sv: Dölj lathund

source: Hide keyword switcher
ru: Скрыть переключатель ключевых слов
sv: Göm tangentbordsväxlaren

source: Highest level reached
ru: Достигнут высочайший уровень
sv: Högsta uppnådda nivån

source: Highest quiz score
ru: Наивысший результат викторины
sv: Högsta quizpoäng

source: Hint?
ru: Подсказать?
sv: Ledtråd?

# input
source: input from {ask}
ru: ввод от `{ask}`
sv: indata från `{ask}`

# integer
source: a number
ru: число
sv: ett tal

# invalid_class_link
source: Invalid link for joining the class.
ru: Недействительная ссылка для присоединения к классу.
sv: Ogiltig länk för att gå med i klassen.

# invalid_teacher_invitation_code
source: The teacher invitation code is invalid. To become a teacher, reach out to hello@hedy.org.
ru: Код приглашения учителя недействителен. Чтобы стать учителем, обратитесь по адресу hello@hedy.org.
sv: Koden för lärarinbjudan är ogiltig. För att bli lärare, kontakta hello@hedy.org.

source: Invalid tutorial step
ru: Неверный шаг учебника
sv: Ogiltigt steg i handledningen

source: Invalid username/password.
ru: Неверное имя пользователя/пароль.
sv: Ogiltigt användarnamn/lösenord.

source: Invite by username
ru: Пригласить по имени пользователя
sv: Bjud in via användarnamn

source: Invite date
ru: Дата приглашения
sv: Datum för inbjudan

# invite_message
source: You have received an invitation to join class
ru: Вы получили приглашение присоединиться к классу
sv: Du har fått en inbjudan att gå med i klassen

# invite_prompt
source: Enter a username
ru: Введите имя пользователя
sv: Ange ett användarnamn

source: Join class
ru: Присоединиться к классу
sv: Gå med i klassen

# join_prompt
source: You need to have an account to join a class. Would you like to login now?
ru: Чтобы присоединиться к занятиям, необходимо иметь учетную запись. Хотите войти в систему сейчас?
sv: Du måste ha ett konto för att gå med i en klass. Vill du logga in nu?

# keyword_language_invalid
source: Please select a valid keyword language (select English or your own language).
ru: Пожалуйста, выберите правильный язык ключевого слова (выберите английский или свой собственный язык).
sv: Välj ett giltigt språk för nyckelord (välj engelska eller ditt eget språk).

# language_invalid
source: Please select a valid language.
ru: Пожалуйста, выберите правильный язык.
sv: Välj ett giltigt språk.

# languages
source: Which of these programming languages have you used before?
ru: Какие из этих языков программирования вы использовали раньше?
sv: Vilka av de här programspråken har du använt tidigare?

source: Last edited
ru: Последнее редактирование
sv: Senast ändrad

source: Last update
ru: Последнее обновление
sv: Senaste uppdatering

source: Last Name
ru: Фамилия
sv: Efternamn

source: Leave class
ru: Покинуть класс
sv: Lämna klassen

source: Level
ru: Уровень
sv: Nivå

# level_not_class
source: This level has not been made available in your class yet
ru: В вашем классе этот уровень ещё не доступен
sv: Den här nivån är inte tillgänglig för din klass ännu

# level_title
source: Level
ru: Уровень
sv: Nivå

source: Link
ru: Ссылка
sv: Länk

# list
source: a list
ru: список
sv: en lista

source: Log in
ru: Войти
sv: Logga in

# login_long
source: Log in to your account
ru: Войдите в свой аккаунт
sv: Logga in på ditt konto

source: Log out
ru: Выйти
sv: Logga ut

source: Longest program
ru: Самая длинная программа
sv: Längsta programmet

# mail_change_password_body
source: Your Hedy password has been changed. If you did this, all is good. If you didn't change your password, please contact us immediately by replying to this email.
ru: Ваш пароль Hedy был изменен. Если вы это сделали, все в порядке. Если вы не изменили свой пароль, пожалуйста, немедленно свяжитесь с нами, ответив на это письмо.
sv: Ditt Hedy-lösenord har ändrats. Om det var du som gjorde det är allt OK. Om du inte har ändrat ditt lösenord, vänligen kontakta oss omedelbart genom att svara på detta mejl.

# mail_change_password_subject
source: Your Hedy password has been changed
ru: Ваш пароль Hedy был изменен
sv: Ditt Hedy-lösenord har ändrats

# mail_error_change_processed
source: Something went wrong when sending a validation mail, the changes are still correctly processed.
ru: Что-то пошло не так при отправке письма с подтверждением, изменения по-прежнему обрабатываются корректно.
sv: Något gick fel när en mejlbekräftelse skickades men ändringarna genomfördes korrekt ändå.

# mail_goodbye
source: Keep programming! The Hedy team
ru: Продолжайте программировать! Команда Hedy
sv: Fortsätt programmera! Hedy-teamet

# mail_hello
source: Hi {username}!
ru: Привет {username}!
sv: Hej {användarnamn}!

# mail_recover_password_body
source: By clicking on this link, you can set a new Hedy password. This link is valid for <b>4</b> hours. If you haven't required a password reset, please ignore this email: {link}
ru: Перейдя по этой ссылке, вы можете установить новый пароль Hedy. Эта ссылка действительна в течение <b>4</b> часов. Если вам не требовался сброс пароля, пожалуйста, проигнорируйте это письмо: {link}
sv: Genom att klicka på den här länken kan du skapa ett nytt lösenord för Hedy. Länken är giltig i <b>4</b> timmar. Om du inte har begärt att få ditt lösenord återställt kan du strunta i detta mejl: {link}

# mail_recover_password_subject
source: Request a password reset.
ru: Запросить сброс пароля.
sv: Begär en lösenordsåterställning.

# mail_reset_password_body
source: Your Hedy password has been reset to a new one. If you did this, all is good. If you didn't change your password, please contact us immediately by replying to this email.
ru: Ваш пароль Hedy был сброшен на новый. Если вы это сделали, все в порядке. Если вы не изменили свой пароль, пожалуйста, немедленно свяжитесь с нами, ответив на это письмо.
sv: Ditt Hedy-lösenord har återställts till ett nytt. Om det var du som gjorde det är allt OK. Om du inte ändrade ditt lösenord, vänligen kontakta oss omedelbart genom att svara på det här mejlet.

# mail_reset_password_subject
source: Your Hedy password has been reset
ru: Ваш пароль Hedy был восстановлен
sv: Ditt Hedy-lösenord har återställts
