Repository: cloudnepal/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru, sv

# teacher_welcome
source: Welcome to Hedy! Your are now the proud owner of a teachers account which allows you to create classes and invite students.
ru: Добро пожаловать в Hedy! Теперь вы являетесь гордым владельцем учетной записи учителя, которая позволяет вам создавать классы и приглашать учеников.
sv: Välkommen till Hedy! Du är nu den stolta ägaren av ett lärarkonto som ger dig möjlighet att skapa klasser och bjuda in elever.

# template_code
source: This is the explanation of my adventure! This way I can show a command: <code>{print}</code> But sometimes I might want to show a piece of code, like this: <pre> {ask} What's your name? {echo} so your name is </pre>
ru: Это объяснение моего приключения! Таким образом я могу показать команду: <code>{print}</code> Но иногда я могу захотеть показать часть кода, например, вот так: <pre> ask Как вас зовут? echo Итак, вас зовут </pre>
sv: Detta är förklaringen till mitt äventyr! Så här kan jag visa ett kommando: <code>{print}</code> Men ibland kanske jag vill visa en kodsnutt, så här: <pre> ask Vad heter du? echo så ditt namn är </pre>

source: Title
ru: Название
sv: Titel

# title_admin
source: Hedy - Administrator page
ru: Hedy - Страница администратора
sv: Hedy - Administratörssida

# title_class-overview
source: Hedy - Class overview
ru: Hedy - Обзор классов
sv: Hedy - Klassöversikt

# title_customize-adventure
source: Hedy - Customize adventure
ru: Hedy - Настроить приключение
sv: Hedy - Anpassa äventyr

# title_customize-class
source: Hedy - Customize class
ru: Hedy - Настройка класса
sv: Hedy - Anpassa klassen

# title_explore
source: Hedy - Explore
ru: Hedy - Обзор
sv: Hedy - Utforska

# title_for-teacher
source: Hedy - For teachers
ru: Hedy - Для учителей
sv: Hedy – För lärare

# title_join-class
source: Hedy - Join class
ru: Hedy - Присоединиться к классу
sv: Hedy - Gå med i klassen

# title_landing-page
source: Welcome to Hedy!
ru: Добро пожаловать в Hedy!
sv: Välkommen till Hedy!

# title_learn-more
source: Hedy - Learn more
ru: Hedy - Узнать больше
sv: Hedy - Lär dig mer

# title_login
source: Hedy - Login
ru: Hedy - Войти
sv: Hedy - Logga in

# title_my-profile
source: Hedy - My account
ru: Hedy - Мой аккаунт
sv: Hedy - Mitt konto

# title_privacy
source: Hedy - Privacy terms
ru: Hedy - Политика конфиденциальности
sv: Hedy - Sekretessvillkor

# title_programs
source: Hedy - My programs
ru: Hedy - Мои программы
sv: Hedy – Mina program

# title_recover
source: Hedy - Recover account
ru: Hedy - Восстановить аккаунт
sv: Hedy - Återställ konto

# title_reset
source: Hedy - Reset password
ru: Hedy - Сбросить пароль
sv: Hedy - Återställ lösenord

# title_signup
source: Hedy - Create an account
ru: Hedy - Зарегистрироваться
sv: Hedy - Skapa ett konto

# title_start
source: Hedy - Textual programming made easy
ru: Hedy - язык постепенного программирования
sv: Hedy - Textprogrammering på ett enkelt sätt

# title_view-adventure
source: Hedy - View adventure
ru: Hedy - Просмотр приключений
sv: Hedy - Visa äventyr

# token_invalid
source: Your token is invalid.
ru: Ваш токен недействителен.
sv: Din inloggningstoken är ogiltig.

# translate_error
source: Something went wrong while translating the code. Try running the code to see if it has an error. Code with errors can not be translated.
ru: Во время перевода кода что-то пошло не так. Попробуйте запустить код, чтобы увидеть возможные ошибки. Код с ошибками не может быть переведён.
sv: Något gick fel när koden översattes. Testa att köra koden för att se om den har ett fel. Kod med fel kan inte översättas.

source: Translating Hedy
ru: Перевод Hedy
sv: Översätta Hedy

source: Tutorial
ru: Учебник
sv: Handledning

# tutorial_code_snippet
source: {print} Hello world! {print} I'm learning Hedy with the tutorial!
ru: {print} Здравствуй мир! {print} Я изучаю Хеди с самоучителем!
sv: {print} Hej världen! {print} Jag lär mig Hedy med handledningen!

# tutorial_message_not_found
source: We couldn't find the requested tutorial step...
ru: Мы не смогли найти требуемый шаг учебника...
sv: Vi kunde inte hitta det önskade steget i handledningen ...

# tutorial_title_not_found
source: Tutorial step not found
ru: Шаг учебника не найден
sv: Handledningssteget hittades inte

# unauthorized
source: You don't have access rights for this page
ru: У вас нет доступа к этой странице
sv: Du har inte åtkomst till den här sidan

# unique_usernames
source: All usernames need to be unique.
ru: Все имена пользователей должны быть уникальными.
sv: Alla användarnamn måste vara unika.

# unlock_thresholds
source: Unlock level thresholds
ru: Разблокировать пороги уровня
sv: Lås upp gränserna för uppgiftsnivån

# unsaved_class_changes
source: There are unsaved changes, are you sure you want to leave this page?
ru: Есть несохраненные изменения, вы уверены, что хотите покинуть эту страницу?
sv: Det finns osparade ändringar; är du säker på att du vill lämna sidan?

# update_adventure_prompt
source: Are you sure you want to update this adventure?
ru: Вы уверены, что хотите обновить это приключение?
sv: Är du säker på att du vill uppdatera det här äventyret?

# update_public
source: Update public profile
ru: Обновление публичного профиля
sv: Uppdatera offentlig profil

source: user
ru: пользователь
sv: användare

# user_inexistent
source: This user doesn't exist
ru: Этот пользователь не существует
sv: Den här användaren finns inte

# user_not_private
source: This user either doesn't exist or doesn't have a public profile
ru: Этот пользователь не существует или у него нет публичного профиля
sv: Användaren finns inte eller har ingen offentlig profil

source: Username
ru: Имя пользователя
sv: Användarnamn

# username_empty
source: You didn't enter an username!
ru: Вы не ввели имя пользователя!
sv: Du har inte matat in något användarnamn!

# username_invalid
source: Your username is invalid.
ru: Ваше имя пользователя недействительно.
sv: Ditt användarnamn är ogiltigt.

# username_special
source: Username cannot contain `:` or `@`.
ru: Имя пользователя не может содержать `:` или `@`.
sv: Användarnamn får inte innehålla `:` eller `@`.

# username_three
source: Username must contain at least three characters.
ru: Имя пользователя должно содержать не менее трех символов.
sv: Användarnamn måste ha minst tre tecken.

# usernames_exist
source: One or more usernames is already in use.
ru: Одно или несколько имен пользователей уже используются.
sv: Ett eller flera användarnamn finns redan.

source: Value
ru: Значение
sv: Värde

source: View program
ru: Просмотр программы
sv: Visa program

source: Welcome
ru: Добро пожаловать
sv: Välkommen

source: Welcome back
ru: С возвращением
sv: Välkommen tillbaka

source: What should my code do?
ru: Что должен делать мой код?
sv: Vad ska min kod göra?

# year_invalid
source: Please enter a year between 1900 and {current_year}.
ru: Пожалуйста, введите год между 1900 и {текущий_год}.
sv: Mata in ett år mellan 1900 och {current_year}.

source: Yes
ru: Да
sv: Ja

# your_account
source: Your profile
ru: Ваш профиль
sv: Din profil

# your_last_program
source: Your last saved program
ru: Ваша последняя сохраненная программа
sv: Ditt senast sparade program

source: Your personal text...
ru: Ваш личный текст...
sv: Din personliga text ...
