Repository: cloudnepal/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru, sv

# mail_welcome_teacher_body
source: <strong>Welcome!</strong> Congratulations on your brand new Hedy teacher's account. Welcome to the world wide community of Hedy teachers! <strong>What teacher's accounts can do</strong> There are a number of extra options unlocked for you now. 1. Extra explanation is available in the <a href="https://hedy.org/for-teachers/manual">teacher's manual</a>. 2. With your teacher account, you can create classes. Your students can than join your classes and you can see their progress. Classes are made and managed though the for <a href="https://hedycode.com/for-teachers">teachers page</a>. 3. You can fully customize your classes, for example you can open and close levels, enable or disable adventures and author your own adventures! <strong>Join our online community!</strong> All Hedy teachers, programmers and other fans are welcome to join our <a href="https://discord.gg/8yY7dEme9r">Discord server</a>. This is the ideal place to chat about Hedy: we have channels where you can show your cool projects and lessons, channels to report bugs, and channels to chat with other teachers and with the Hedy team. <strong>How to ask for help </strong> If anything is unclear, you can let us know on Discord, or <a href="mailto: hello@hedy.org">send us an email</a>. <strong>How to report bugs</strong> In Discord, we have a channel for reporting bugs, called #bugs. That is the perfect place to let us know about issues you are running into. If you know how to use GitHub, you can create an <a href="https://github.com/Felienne/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a> there.
ru: <strong>Добро пожаловать! </strong> Поздравляем вас с новой учетной записью учителя Hedy. Добро пожаловать во всемирное сообщество учителей Hedy! <strong>Что могут учительские аккаунты</strong>. Теперь для вас открыт ряд дополнительных возможностей. 1. Дополнительные объяснения доступны в <a href="https://hedy.org/for-teachers/manual">руководстве учителя</a>. 2. С помощью учетной записи учителя вы можете создавать классы. Затем ваши ученики могут присоединиться к вашим занятиям, а вы сможете наблюдать за их успехами. Классы создаются и управляются через страницу <a href="https://hedycode.com/for-teachers">учителя</a>. 3. Вы можете полностью настраивать свои классы, например, открывать и закрывать уровни, включать и выключать приключения, а также создавать свои собственные приключения! <strong>Присоединяйтесь к нашему онлайн-сообществу!</strong> Все учителя Hedy, программисты и другие фанаты могут присоединиться к нашему <a href="https://discord.gg/8yY7dEme9r">Discord серверу</a>. Это идеальное место для общения о Hedy: у нас есть каналы, где вы можете показать свои классные проекты и уроки, каналы для сообщения об ошибках и каналы для общения с другими учителями и командой Hedy. <strong>Как попросить о помощи </strong>. Если что-то непонятно, вы можете сообщить нам об этом в Discord или <a href="mailto: hello@hedy.org">написать нам письмо</a>. <strong>Как сообщать об ошибках</strong>. В Discord у нас есть канал для сообщений об ошибках, который называется #bugs. Это идеальное место, чтобы сообщить нам о проблемах, с которыми вы столкнулись. Если вы умеете пользоваться GitHub, вы можете создать <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">проблему</a> там.
sv: <strong>Välkommen!</strong> Grattis till ditt nya Hedy-lärarkonto. Välkommen till gemenskapen för Hedy-lärare jorden runt! <strong>Vad lärarkonton kan göra</strong> Du har ett antal extra alternativ som är upplåsta nu. 1. Extra förklaringar finns i <a href="https://hedy.org/for-teachers/manual">lärarhandboken</a>. 2. Med ditt lärarkonto kan du skapa klasser. Dina elever kan sedan gå med i dina klasser och du kan se deras framsteg. Klasserna skapas och hanteras på <a href="https://hedycode.com/for-teachers">lärarsidan</a>. 3. Du kan anpassa dina klasser helt och hållet; till exempel kan du öppna och stänga nivåer, aktivera eller stänga av äventyr och skriva dina egna äventyr! <strong>Gå med i vår online-gemenskap!</strong> Alla Hedy-lärare, programmerare och andra fans är välkomna att gå med i vår <a href="https://discord.gg/8yY7dEme9r">Discord-server</a>. Detta är den perfekta platsen för att prata om Hedy: vi har kanaler där du kan visa dina häftiga projekt och lektioner, kanaler för att rapportera fel och kanaler för att chatta med andra lärare och med Hedy-teamet. <strong>Hur du ber om hjälp </strong> Om något är oklart kan du fråga på Discord eller <a href="mailto: hello@hedy.org">skicka ett mejl till oss</a>. <strong>Hur man rapporterar buggar</strong> I Discord har vi en kanal för att rapportera fel och den heter #bugs. Det är den perfekta platsen för att rapportera problem du stöter på. Om du vet hur man använder GitHub kan du skapa en <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a> där.

# mail_welcome_teacher_subject
source: Your Hedy teacher account is ready
ru: Ваш аккаунт преподавателя Hedy готов
sv: Ditt Hedy-lärarkonto är klart

# mail_welcome_verify_body
source: Your Hedy account has been created successfully. Welcome! Please click on this link to verify your email address: {link}
ru: Ваша учетная запись в Hedy успешно создана. Добро пожаловать! Пожалуйста, нажмите на эту ссылку, чтобы проверить ваш адрес электронной почты: {link}
sv: Ditt Hedy-konto har skapats. Välkommen! Klicka på den här länken för att bekräfta din mejladress: {link}

# mail_welcome_verify_subject
source: Welcome to Hedy
ru: Добро пожаловать в Hedy
sv: Välkommen till Hedy

# mailing_title
source: Subscribe to the Hedy newsletter
ru: Подписаться на новостную рассылку Hedy
sv: Prenumerera på Hedys nyhetsbrev

# main_subtitle
source: Textual programming for the classroom
ru: Поэтапный язык программирования
sv: Textprogrammering för klassrummet

source: Male
ru: Мужчина
sv: Kille

# mandatory_mode
source: Mandatory developer's mode
ru: Обязательный режим разработчика
sv: Obligatoriskt utvecklarläge

source: My account
ru: Мой аккаунт
sv: Mitt konto

source: My adventures
ru: Мои приключения
sv: Mina äventyr

source: My classes
ru: Мои классы
sv: Mina lektioner

source: My messages
ru: Мои сообщения
sv: Mina meddelanden

source: Name
ru: Имя
sv: Namn

# nav_explore
source: Explore
ru: Обзор
sv: Utforska

# nav_learn_more
source: Learn more
ru: Узнать больше
sv: Lär dig mer

# nav_start
source: Home
ru: Главная
sv: Hem

source: New password
ru: Новый пароль
sv: Nytt lösenord

# newline
source: a new line
ru: новая линия
sv: en ny rad

source: Next exercise
ru: Следующее упражнение
sv: Nästa övning

# next_step_tutorial
source: Next step >>>
ru: Следующий шаг >>>
sv: Nästa steg >>>

source: No
ru: Нет
sv: Nej

source: No account?
ru: Нет аккаунта?
sv: Inget konto?

# no_accounts
source: There are no accounts to create.
ru: Нет учетных записей для создания.
sv: Det finns inga konton att skapa.

# no_more_flat_if
source: Starting in level 8, the line after {if} needs to start with 4 spaces.
ru: Начиная с 8-го уровня, строка после `{if}` должна начинаться с 4 пробелов.
sv: Från och med nivå 8 måste koden efter `{if}` placeras på nästa rad och börja med fyra mellanslag.

# no_public_profile
source: You don't have a public profile text yet...
ru: У вас еще нет общедоступного текста профиля...
sv: Du har inte en offentlig profiltext än ...

# no_shared_programs
source: has no shared programs...
ru: нету общих программ...
sv: har inga delade program ...

# no_such_adventure
source: This adventure doesn't exist!
ru: Этого приключения не существует!
sv: Det här äventyret finns inte!

# no_such_class
source: No such Hedy class.
ru: Нет такого класса Hedy.
sv: Det finns ingen sådan Hedy-lektion.

# no_such_level
source: No such Hedy level!
ru: Нет такого уровня Хеди!
sv: Det finns ingen sådan Hedy-nivå!

# no_such_program
source: No such Hedy program!
ru: Нет такой программы Хеди!
sv: Det finns inget sådant Hedy-program!

# not_enrolled
source: Looks like you are not in this class!
ru: Похоже, вы не в классе!
sv: Verkar som att du inte är i den här klassen!

# not_teacher
source: Looks like you are not a teacher!
ru: Похоже, Вы не преподаватель!
sv: Verkar som att du inte är en lärare!

# number
source: a number
ru: число
sv: ett tal

# number_lines
source: Number of lines
ru: Количество строк
sv: Antal rader

# number_programs
source: Number of programs ran
ru: Количество запущенных программ
sv: Antal körda program

source: Open
ru: Открыть
sv: Öppna

source: Opening date
ru: Дата открытия
sv: Öppningsdatum

source: Opening dates
ru: Даты открытия
sv: Öppningsdatum

source: Option
ru: Вариант
sv: Alternativ

source: or
ru: или
sv: eller

source: Other
ru: Другое
sv: Övrig

# other_block
source: Another block language
ru: Другой язык блока
sv: Något annat blockbaserat språk

source: Other settings
ru: Другие настройки
sv: Andra inställningar

# other_source
source: Other
ru: Другое
sv: Annat

# other_text
source: Another text language
ru: Другой язык текста
sv: Ett annat textbaserat språk

# overwrite_warning
source: You already have a program with this name, saving this program will replace the old one. Are you sure?
ru: У вас уже есть программа с таким наванием. Вы точно хотите перезаписать уже существующую программу?
sv: Du har redan ett program med det här namnet; om du sparar det här programmet kommer det att ersätta det gamla. Är du säker?

# page_not_found
source: We couldn't find that page!
ru: Мы не смогли найти эту страницу!
sv: Vi kunde inte hitta den sidan!

# parsons_title
source: Puzzle
ru: Головоломка
sv: Pussel

source: Password
ru: Пароль
sv: Lösenord

# password_change_not_allowed
source: You're not allowed to change the password of this user.
ru: Вам не разрешено изменять пароль этого пользователя.
sv: Du får inte ändra lösenord för den här användaren.

# password_change_prompt
source: Are you sure you want to change this password?
ru: Вы уверены, что хотите изменить пароль?
sv: Är du säker på att du vill ändra lösenordet?

# password_change_success
source: Password of your student is successfully changed.
ru: Пароль вашего студента успешно изменен.
sv: Elevlösenordet har ändrats.

# password_invalid
source: Your password is invalid.
ru: Ваш пароль недействителен.
sv: Ditt lösenord är ogiltigt.

# password_repeat
source: Repeat password
ru: Повторите пароль
sv: Upprepa lösenordet

# password_resetted
source: Your password has been successfully reset. You are being redirected to the login page.
ru: Ваш пароль был успешно восстановлен. Вы перенаправлены на страницу входа в систему.
sv: Ditt lösenord har återställts. Du skickas nu vidare till inloggningssidan.

# password_six
source: Your password must contain at least six characters.
ru: Ваш пароль должен содержать не менее шести символов.
sv: Lösenordet måste ha minst sex tecken.

source: Password updated.
ru: Пароль обновлен.
sv: Lösenordet har uppdaterats.

# passwords_six
source: All passwords need to be six characters or longer.
ru: Все пароли должны состоять из шести или более символов.
sv: Alla lösenord måste ha minst sex tecken.

source: Pending invites
ru: Ожидающие приглашения
sv: Väntande inbjudningar

source: percentage
ru: процент
sv: procentandel

# period
source: a period
ru: период
sv: en punkt

source: Personal text
ru: Личный текст
sv: Personlig text

# personal_text_invalid
source: Your personal text is invalid.
ru: Ваш персональный текст неверен.
sv: Din personliga text är ogiltig.

source: Postfix classname
ru: Имя постфикса класса
sv: Postfix till lektionsnamnet

source: Preferred keyword language
ru: Предпочитаемый язык ключевых слов
sv: Önskat språk för nyckelord

source: Preferred language
ru: Предпочитаемый язык
sv: Önskat språk

source: Preview
ru: Предварительный просмотр
sv: Förhandsgranskning

# previous_campaigns
source: View previous campaigns
ru: Посмотреть предыдущие кампании
sv: Visa tidigare kampanjer

source: Privacy terms
ru: Условия конфиденциальности
sv: Sekretessvillkor

# profile_logo_alt
source: Profile icon.
ru: Значок профиля.
sv: Profilikon.

source: Profile picture
ru: Изображение профиля
sv: Profilbild

source: Profile updated.
ru: Профиль обновлен.
sv: Profilen har uppdaterats.

# profile_updated_reload
source: Profile updated, page will be re-loaded.
ru: Профиль обновлен, страница будет перезагружена.
sv: Profilen har uppdaterats och sidan laddas om.

# program_contains_error
source: This program contains an error, are you sure you want to share it?
ru: Эта программа содержит ошибку. Вы уверены в том, что хотите поделиться ею?
sv: Det här programmet innehåller ett fel. Är du säker på att du vill dela det?

# program_header
source: My programs
ru: Мои программы
sv: Mina program

# programming_experience
source: Do you have programming experience?
ru: Есть ли у вас опыт программирования?
sv: Har du erfarenhet av programmering?

# programming_invalid
source: Please select a valid programming language.
ru: Пожалуйста, выберите правильный язык программирования.
sv: Välj ett giltigt programspråk.

source: Programs
ru: Программы
sv: Program

# prompt_join_class
source: Do you want to join this class?
ru: Вы хотите присоединиться к этому классу?
sv: Vill du gå med i den här klassen?

# public_invalid
source: This agreement selection is invalid
ru: Выбор данного соглашения является недействительным
sv: Avtalsvalet är ogiltigt

source: Public profile
ru: Публичный профиль
sv: Offentlig profil

# public_profile_info
source: By selecting this box I make my profile visible for everyone. Be careful not to share personal information like your name or home address, because everyone will be able to see it!
ru: Установив этот флажок, я делаю свой профиль видимым для всех. Будьте осторожны, не сообщайте личную информацию, такую как ваше имя или домашний адрес, потому что все смогут ее увидеть!
sv: Genom att markera den här rutan gör jag min profil synlig för alla. Var noga med att inte dela personlig information som ditt namn eller hemadress, eftersom alla kommer att kunna se uppgifterna!

# public_profile_updated
source: Public profile updated, page will be re-loaded.
ru: Публичный профиль был обновлён, страница скоро перезагрузится.
sv: Offentlig profil uppdaterad och sidan laddas om.

# question mark
source: a question mark
ru: вопросительный знак
sv: ett frågetecken

# quiz_logo_alt
source: Quiz logo
ru: Логотип викторины
sv: Quiz-logga

source: Quiz score
ru: Результаты викторины
sv: Quiz-poäng

# quiz_tab
source: Quiz
ru: Викторина

# quiz_threshold_not_reached
source: Quiz threshold not reached to unlock this level
ru: Вы не набрали пороговый тестовый балл, нужный для открытия этого уровня
sv: För lågt resultat på quizet för att låsa upp den här nivån

# read_code_label
source: Read aloud
ru: Чтение вслух
sv: Läs högt

# recent
source: My recent programs
ru: Мои недавние программы
sv: Mina senaste program

# recover_password
source: Request a password reset
ru: Запрос на сброс пароля
sv: Begär återställning av lösenord

# regress_button
source: Go back to level {level}
ru: Вернуться на уровень {level}
sv: Gå tillbaka till nivå {level}

source: Remove
ru: Удалить
sv: Ta bort

source: Remove customization
ru: Удалите настройку
sv: Ta bort anpassning

# remove_customizations_prompt
source: Are you sure you want to remove this class's customizations?
ru: Вы уверены, что хотите удалить настройки этого класса?
sv: Är du säker på att du vill ta bort anpassningarna för den här klassen?

# remove_student_prompt
source: Are you sure you want to remove the student from the class?
ru: Вы уверены, что хотите удалить ученика из класса?
sv: Är du säker på att du vill ta bort eleven från klassen?

# repair_program_logo_alt
source: Repair program icon
ru: Восстановление значка программы
sv: Ikon för programreparation

# repeat_match_password
source: The repeated password does not match.
ru: Повторный пароль не совпадает.
sv: Det upprepade lösenordet stämmer inte.

source: Repeat new password
ru: Повторите новый пароль
sv: Upprepa det nya lösenordet

# report_failure
source: This program does not exist or is not public
ru: Эта программа не существует или не является публичной
sv: Programmet finns inte eller är inte offentligt

# report_program
source: Are you sure you want to report this program?
ru: Вы уверены, что хотите сообщить об этой программе?
sv: Är du säker på att du vill rapportera det här programmet?

# report_success
source: This program has been reported
ru: Эта программа была сообщена
sv: Programmet har rapporterats

# request_teacher
source: Would you like to apply for a teacher's account?
ru: Вы хотите подать заявку на учетную запись учителя?
sv: Vill du ansöka om ett lärarkonto?

source: Request teacher account
ru: Запросить учетную запись учителя
sv: Ansök om lärarkonto

# required_field
source: Fields marked with an * are required
ru: Поля, отмеченные знаком *, обязательны для заполнения
sv: Fält markerade med * är obligatoriska

# reset_adventure_prompt
source: Are you sure you want to reset all selected adventures?
ru: Вы уверены, что хотите сбросить все выбранные приключения?
sv: Är du säker på att du vill återställa alla de valda äventyren?

# reset_adventures
source: Reset selected adventures
ru: Сброс выбранных приключений
sv: Återställ valda äventyr

source: Reset password
ru: Сброс пароля
sv: Återställ lösenord

# reset_view
source: Reset
ru: Сброс
sv: Återställ

# retrieve_adventure_error
source: You're not allowed to view this adventure!
ru: Вы не можете посмотреть это приключение!
sv: Du får inte se detta äventyr!

# retrieve_class_error
source: Only teachers can retrieve classes
ru: Только преподаватели могут получать классы
sv: Bara lärare kan hämta klasser

# run_code_button
source: Run code
ru: Выполнить код
sv: Kör kod

# save_parse_warning
source: This program contains an error, are you sure you want to save it?
ru: Эта программа содержит ошибку, вы уверены, что хотите сохранить ее?
sv: Programmet har ett fel; är du säker på att du vill spara det?

# save_prompt
source: You need to have an account to save your program. Would you like to login now?
ru: Чтобы сохранить свою программу, необходимо иметь учетную запись. Хотите войти в систему сейчас?
sv: Du måste ha ett konto för att spara ditt program. Vill du logga in nu?

# save_success_detail
source: Program saved successfully.
ru: Программа сохранена.
sv: Programmet har sparats.

source: Score
ru: Счёт
sv: Poäng

source: Search...
ru: Поиск...
sv: Sök ...

# search_button
source: Search
ru: Поиск
sv: Sök

# see_certificate
source: See {username} certificate!
ru: См. сертификат {username}!
sv: Se diplom för {username}!

source: Select
ru: Выбрать
sv: Välj

# select_adventures
source: Select and order adventures
ru: Выберите приключения
sv: Välj och beställ äventyr

source: Select levels
ru: Выберите уровни

# self_removal_prompt
source: Are you sure you want to leave this class?
ru: Вы уверены, что хотите покинуть этот класс?
sv: Är du säker på att du vill lämna den här klassen?

# send_password_recovery
source: Send me a password recovery link
ru: Отправьте мне ссылку для восстановления пароля
sv: Skicka mig en länk för återställning av lösenord

# sent_by
source: This invitation is sent by
ru: Это приглашение отправлено
sv: Denna inbjudan skickas av

# sent_password_recovery
source: You should soon receive an email with instructions on how to reset your password.
ru: Вскоре вы должны получить электронное письмо с инструкциями по сбросу пароля.
sv: Du bör snart få ett e-postmeddelande med instruktioner hur du återställer ditt lösenord.

# settings
source: My personal settings
ru: Мои личные настройки
sv: Mina inställningar

# signup_student_or_teacher
source: Are you a student or a teacher?
ru: Вы студент или учитель?
sv: Är du elev eller lärare?

# single quotes
source: a single quote
ru: одинарная кавычка
sv: ett enkelt citattecken

# slash
source: a slash
ru: слэш
sv: ett snedstreck

source: Social media
ru: Социальные сети
sv: Sociala medier

# something_went_wrong_keyword_parsing
source: There is a mistake in your adventure, are all keywords correctly surrounded with { }?
ru: В вашем приключении есть ошибка, все ли ключевые слова правильно окружены { }?
sv: Det finns ett misstag i ditt äventyr; är alla nyckelord skrivna inom { }?

# space
source: a space
ru: пространство
sv: ett mellanslag

# star
source: a star
ru: звезда
sv: en stjärna

source: Start hedy tutorial
ru: Начать обучение
sv: Starta Hedy-handledning

source: Start programming
ru: Начать программирование
sv: Börja programmera

# start_programming_logo_alt
source: Start programming icon
ru: Значок начала программирования
sv: Ikonen Starta programmering

source: Start quiz
ru: Начать викторину
sv: Starta quiz

source: Start teacher tutorial
ru: Начать обучение для учителей
sv: Starta lärarhandledning

# step_title
source: Assignment
ru: Задание
sv: Uppgift

# stop_code_button
source: Stop program
ru: Остановить программу
sv: Stoppa programmet

# string
source: text
ru: текст

# student_already_in_class
source: This student is already in your class.
ru: Этот ученик уже учится в вашем классе.
sv: Den här eleven går redan i din klass.

# student_already_invite
source: This student already has a pending invitation.
ru: У этого студента уже есть ожидающее приглашение.
sv: Eleven har redan en väntande inbjudan.

# student_not_existing
source: This username doesn't exist.
ru: Этого имени пользователя не существует.
sv: Användarnamnet finns inte.

# student_signup_header
source: Student
ru: Студент
sv: Elev

source: students
ru: студенты
sv: elever

# submission_time
source: Handed in at
ru: Сдано
sv: Inlämnad vid

# submit_answer
source: Answer question
ru: Вопрос-ответ
sv: Svara på frågan

# submit_program
source: Submit
ru: Отправить
sv: Lämna in

# submit_warning
source: Are you sure you want to submit this program?
ru: Вы уверены, что хотите отправить эту программу?
sv: Är du säker på att du vill lämna in det här programmet?

source: Submitted
ru: Отправлено
sv: Inlämnad

# submitted_header
source: This is a submitted program and can't be altered.
ru: Это представленная программа, и она не может быть изменена.
sv: Programmet är inlämnat och kan inte ändras.

source: Subscribe
ru: Подписаться
sv: Prenumerera

# subscribe_newsletter
source: Subscribe to the newsletter
ru: Подписаться на рассылку новостей
sv: Prenumerera på nyhetsbrevet

# surname
source: First Name
ru: Имя
sv: Förnamn

source: Teacher
ru: Учитель
sv: Lärare

# teacher_account_request
source: You have a pending teacher account request
ru: У вас есть нерассмотренный запрос на учетную запись преподавателя
sv: Du har en väntande begäran om lärarkonto

# teacher_account_success
source: You successfully requested a teacher account.
ru: Вы успешно запросили учетную запись учителя.
sv: Du har beställt ett lärarkonto.

# teacher_invalid
source: Your teacher value is invalid.
ru: Значение вашего учителя недействительно.
sv: Lärarvärdet är ogiltigt.

# teacher_invitation_require_login
source: To set up your profile as a teacher, we will need you to log in. If you don't have an account, please create one.
ru: Чтобы настроить ваш профиль учителя, вам необходимо войти в систему. Если у вас нет учетной записи, пожалуйста, создайте ее.
sv: För att skapa din lärarprofil behöver du logga in. Om du inte har något konto kan du skapa ett.

source: Teacher manual
ru: Руководство для учителей
sv: Lärarhandledning

# teacher_signup_header
source: Teacher
ru: Учитель
sv: Lärare

# teacher_tutorial_logo_alt
source: Teacher tutorial icon
ru: Иконка для учителя
sv: Ikon för lärarhandledning
